import itertools

c = 0

for w in set(itertools.product('ВИШНЯ', repeat = 6)):   #Перебираем все варианты без повторов:
                                                            #'Н', 'И', 'Ш', 'Ш', 'И', 'В'), ('В', 'В', 'И', 'Ш', 'В', 'И'), ('И', 'Н', 'И', 'Ш', 'В', 'Н'),
                                                            #('Н', 'Я', 'Я', 'В', 'И', 'Я'), ('Н', 'Я', 'Я', 'Ш', 'Ш', 'В'), ('Н', 'Ш', 'В', 'В', 'Н', 'Ш'),
                                                            #('Я', 'Ш', 'Н', 'Ш', 'И', 'Я'), ('Н', 'Ш', 'Н', 'В', 'В', 'Я'), ('Н', 'Н', 'Ш', 'Ш', 'В', 'И'),
                                                            #('Ш', 'Я', 'Ш', 'Ш', 'Я', 'Я'), ('Я', 'В', 'В', 'Н', 'Я', 'Н'), ('Ш', 'Н', 'Н', 'Н', 'В', 'Ш')
                                                            # и т.д.
                                                            
    w = ''.join(w)      # Кортеж в строку
    if w.count('В') <= 1 and w[0] != 'Ш' and w[-1] != 'И' and w[-1] != 'Я':     # c += 1, если подходит
        c += 1

print(c)
