# Сколько значащих нулей в двоичной записи числа 8152 + 4915 - 2778 - 471 - 231 - 30

n = 8 ** 152 + 4 ** 915 - 2 ** 778 - 4 ** 71 - 2 ** 31 - 30
c = 0

while (n > 0):
    if (n % 2 == 0):
        c += 1

    n //= 2

print (c)
